![](logo.png)
## Day Objectives
# Pandas
- Pandas is a built in library using for data analysis. You'll be using Pandas heavily for data manipulation, visualisation, building machine learning models, etc.
- Pandas implements a number of powerful data operations familiar to users of both database frameworks and spreadsheet programs.
- There are two main data structures in Pandas - Series and Dataframes. The default way to store data is dataframes, and thus manipulating dataframes quickly is probably the most important skill set for data analysis.
- Source: https://pandas.pydata.org/pandas-docs/stable/overview.html
## Pandas Series
- A series is similar to a 1-D numpy array, and contains values of the same type (numeric, character, datetime  etc.). A dataframe is simply a table where each column is a pandas series.

## creating series
- List
- Tuple
- Dictionary
- Numpy
- Date_Range
- Series Indexing

## Data Analysis with Pandas
* Pandas DataFrame
* Combining & Merging
* File I/O
* Indexing
* Grouping
* Features
* Filtering
* Sorting
* Statistical
* Plotting
* Saving

|S.No |Name |Gender|
|--|--|--|
|1 | Mercy | Female|
|2 | Cherry | Male |
|3 | Raju | Male |

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\lavan\anaconda3\lib\site-packages (1.0.5)
Requirement already satisfied: pytz>=2017.2 in c:\users\lavan\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.13.3 in c:\users\lavan\anaconda3\lib\site-packages (from pandas) (1.18.5)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\lavan\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\lavan\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

# Pandas Series

In [5]:
# creating pandas series using list
li = [12,343,445,656,7]
s1 = pd.Series(li)
s1

0     12
1    343
2    445
3    656
4      7
dtype: int64

In [6]:
type(s1)

pandas.core.series.Series

In [7]:
t = (1,2,3,4,"string",34.45)
s2 = pd.Series(t)
s2

0         1
1         2
2         3
3         4
4    string
5     34.45
dtype: object

In [12]:
import numpy as np
di = {"A":123,"B":456,"C":789,"D": np.nan}
s3 = pd.Series(di)
s3
# NaN = not a number , special type float

A    123.0
B    456.0
C    789.0
D      NaN
dtype: float64

In [15]:
n = np.array(li)
print(n)
s4 = pd.Series(n)
s4

[ 12 343 445 656   7]

0     12
1    343
2    445
3    656
4      7
dtype: int32

In [17]:
s4

0     12
1    343
2    445
3    656
4      7
dtype: int32

# Slicing & Indexing

In [18]:
s4[2]

445

In [20]:
s4[0]

12

In [21]:
s4[:3]

0     12
1    343
2    445
dtype: int32

In [22]:
s4[2:]

2    445
3    656
4      7
dtype: int32

In [23]:
s3

A    123.0
B    456.0
C    789.0
D      NaN
dtype: float64

In [26]:
s3["A"]

123.0

In [27]:
s3["D"]

nan

In [29]:
s3["A":"C"] # explicit slicing

A    123.0
B    456.0
C    789.0
dtype: float64

In [31]:
s3[1], s3["B"]

(456.0, 456.0)

In [32]:
# 0,2 from s3
s3[0::2]

A    123.0
C    789.0
dtype: float64

In [33]:
# Fancy Slicing
# 0,3,1
s3[[0,3,1]]

A    123.0
D      NaN
B    456.0
dtype: float64

In [34]:
s3.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [35]:
s3.values

array([123., 456., 789.,  nan])

In [37]:
s5 = pd.date_range(start= "2021-07-21", end = "2021-08-07")
s5

DatetimeIndex(['2021-07-21', '2021-07-22', '2021-07-23', '2021-07-24',
               '2021-07-25', '2021-07-26', '2021-07-27', '2021-07-28',
               '2021-07-29', '2021-07-30', '2021-07-31', '2021-08-01',
               '2021-08-02', '2021-08-03', '2021-08-04', '2021-08-05',
               '2021-08-06', '2021-08-07'],
              dtype='datetime64[ns]', freq='D')

In [38]:
s3.dtype

dtype('float64')

In [39]:
s3.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [40]:
s3.index = ["x","y","z","q"]
s3

x    123.0
y    456.0
z    789.0
q      NaN
dtype: float64

# Task :
- Create one series having index values start from 0 to 15 and values are mul by 5 with index

In [42]:
s = pd.Series(np.arange(0,15)*5,index = np.arange(0,16))
s

ValueError: Length of passed values is 15, index implies 16.

In [43]:
s = pd.Series(np.arange(0,16)*5,index = np.arange(0,16))
s

0      0
1      5
2     10
3     15
4     20
5     25
6     30
7     35
8     40
9     45
10    50
11    55
12    60
13    65
14    70
15    75
dtype: int32

# Pandas DataFrames

In [48]:
# creating Df using list
a2 = [[1,2,3],[4,5,6],[6,7,8]]
df1 = pd.DataFrame(a2)
df1
# default columns and rows starts from 0

   0  1  2
0  1  2  3
1  4  5  6
2  6  7  8

In [50]:
df1.columns = ["s","q","t"]
df1

   s  q  t
0  1  2  3
1  4  5  6
2  6  7  8

In [52]:
df1.index = ["a","b","c"]
df1

   s  q  t
a  1  2  3
b  4  5  6
c  6  7  8

In [59]:
di = {
    "Name"  : ["Lavanya","Praveen","Anurag","Nagaraju"],
    "Fcolor":["White","Black","Red",np.nan],
    "Gender":["f","m","m","m"]
}
df2 = pd.DataFrame(di)
# df2.index = np.arange(1,4)
df2

       Name Fcolor Gender
0   Lavanya  White      f
1   Praveen  Black      m
2    Anurag    Red      m
3  Nagaraju    NaN      m

In [60]:
df2.index

RangeIndex(start=0, stop=4, step=1)

In [61]:
df2.columns

Index(['Name', 'Fcolor', 'Gender'], dtype='object')

In [63]:
type(df2)

pandas.core.frame.DataFrame

In [64]:
df2.shape # rows,columns

(4, 3)

In [65]:
df2.ndim

2

In [67]:
type(df2["Name"])

pandas.core.series.Series

In [68]:
df2["Name"] # series

0     Lavanya
1     Praveen
2      Anurag
3    Nagaraju
Name: Name, dtype: object

In [70]:
df2[["Name","Gender"]] # df

       Name Gender
0   Lavanya      f
1   Praveen      m
2    Anurag      m
3  Nagaraju      m

In [72]:
df2[0]

KeyError: 0

In [73]:
df2[0:1]

      Name Fcolor Gender
0  Lavanya  White      f

In [75]:
df2[0:3]

      Name Fcolor Gender
0  Lavanya  White      f
1  Praveen  Black      m
2   Anurag    Red      m

In [76]:
df2[::2]

      Name Fcolor Gender
0  Lavanya  White      f
2   Anurag    Red      m

In [77]:
df2[1::2]

       Name Fcolor Gender
1   Praveen  Black      m
3  Nagaraju    NaN      m

In [80]:
# access Praveen Fcolor
df2[1:2]["Fcolor"]

1    Black
Name: Fcolor, dtype: object

In [81]:
# access fcolor of lavanya & anurag
df2[::2]["Fcolor"]

0    White
2      Red
Name: Fcolor, dtype: object

## iloc -- for accessing rows using integer indicies
## loc -- for accessing rows other than integer indicies

In [82]:
df2.iloc[0]

Name      Lavanya
Fcolor      White
Gender          f
Name: 0, dtype: object

In [83]:
df2.iloc[-1]

Name      Nagaraju
Fcolor         NaN
Gender           m
Name: 3, dtype: object

In [84]:
df2.iloc[0:2]

      Name Fcolor Gender
0  Lavanya  White      f
1  Praveen  Black      m

In [86]:
df2.loc[1,"Gender"]

'm'

In [87]:
df2.loc[[0,2,3],"Gender"]

0    f
2    m
3    m
Name: Gender, dtype: object

In [88]:
df2.loc[[0,2,3],["Name","Gender"]]

       Name Gender
0   Lavanya      f
2    Anurag      m
3  Nagaraju      m

In [89]:
df2.set_index("Name")

         Fcolor Gender
Name
Lavanya   White      f
Praveen   Black      m
Anurag      Red      m
Nagaraju    NaN      m

In [90]:
df2

       Name Fcolor Gender
0   Lavanya  White      f
1   Praveen  Black      m
2    Anurag    Red      m
3  Nagaraju    NaN      m

In [91]:
df2.set_index("Name", inplace = True)
df2

         Fcolor Gender
Name
Lavanya   White      f
Praveen   Black      m
Anurag      Red      m
Nagaraju    NaN      m

In [92]:
df2.loc["Lavanya","Fcolor"]

'White'

In [93]:
df2.loc[["Lavanya","Praveen"],["Gender"]]

        Gender
Name
Lavanya      f
Praveen      m

In [96]:
df2.reset_index(inplace= True)

In [97]:
df2

       Name Fcolor Gender
0   Lavanya  White      f
1   Praveen  Black      m
2    Anurag    Red      m
3  Nagaraju    NaN      m

# Merge / concat / Append

In [106]:
d3 = {
    "Name"  : ["Lavanya","Praveen","Anurag","Nagaraju", "Priya"],
    "Branch" : ["Cse","IT","ECE", "CSe", "Mech"]
}
df3 = pd.DataFrame(d3)
df3

       Name Branch
0   Lavanya    Cse
1   Praveen     IT
2    Anurag    ECE
3  Nagaraju    CSe
4     Priya   Mech

In [107]:
pd.concat([df2,df3],axis = 0)
# axis = 0 at rows, axis =1 at columns

       Name Fcolor Gender Branch
0   Lavanya  White      f    NaN
1   Praveen  Black      m    NaN
2    Anurag    Red      m    NaN
3  Nagaraju    NaN      m    NaN
0   Lavanya    NaN    NaN    Cse
1   Praveen    NaN    NaN     IT
2    Anurag    NaN    NaN    ECE
3  Nagaraju    NaN    NaN    CSe
4     Priya    NaN    NaN   Mech

In [108]:
pd.concat([df2,df3],axis = 1) # concat at columns

       Name Fcolor Gender      Name Branch
0   Lavanya  White      f   Lavanya    Cse
1   Praveen  Black      m   Praveen     IT
2    Anurag    Red      m    Anurag    ECE
3  Nagaraju    NaN      m  Nagaraju    CSe
4       NaN    NaN    NaN     Priya   Mech

In [109]:
df2.append(df3) # at rows

       Name Fcolor Gender Branch
0   Lavanya  White      f    NaN
1   Praveen  Black      m    NaN
2    Anurag    Red      m    NaN
3  Nagaraju    NaN      m    NaN
0   Lavanya    NaN    NaN    Cse
1   Praveen    NaN    NaN     IT
2    Anurag    NaN    NaN    ECE
3  Nagaraju    NaN    NaN    CSe
4     Priya    NaN    NaN   Mech

In [110]:
df3.append(df2)

       Name Branch Fcolor Gender
0   Lavanya    Cse    NaN    NaN
1   Praveen     IT    NaN    NaN
2    Anurag    ECE    NaN    NaN
3  Nagaraju    CSe    NaN    NaN
4     Priya   Mech    NaN    NaN
0   Lavanya    NaN  White      f
1   Praveen    NaN  Black      m
2    Anurag    NaN    Red      m
3  Nagaraju    NaN    NaN      m

In [111]:
pd.merge(df2,df3) # common data members

       Name Fcolor Gender Branch
0   Lavanya  White      f    Cse
1   Praveen  Black      m     IT
2    Anurag    Red      m    ECE
3  Nagaraju    NaN      m    CSe

In [113]:
df2

       Name Fcolor Gender
0   Lavanya  White      f
1   Praveen  Black      m
2    Anurag    Red      m
3  Nagaraju    NaN      m

In [116]:
pd.merge(df2,df3, how = "left") # priority is df2

       Name Fcolor Gender Branch
0   Lavanya  White      f    Cse
1   Praveen  Black      m     IT
2    Anurag    Red      m    ECE
3  Nagaraju    NaN      m    CSe

In [115]:
help(pd.merge)

Help on function merge in module pandas.core.reshape.merge:

merge(left, right, how: str = 'inner', on=None, left_on=None, right_on=None, left_index: bool = False, right_index: bool = False, sort: bool = False, suffixes=('_x', '_y'), copy: bool = True, indicator: bool = False, validate=None) -> 'DataFrame'
    Merge DataFrame or named Series objects with a database-style join.

    The join is done on columns or indexes. If joining columns on
    columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
    on indexes or indexes on a column or columns, the index will be passed on.

    Parameters
    ----------
    left : DataFrame
    right : DataFrame or named Series
        Object to merge with.
    how : {'left', 'right', 'outer', 'inner'}, default 'inner'
        Type of merge to be performed.

        * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order.
        * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order.
        * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically.
        * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys.
    on : label or list
        Column or index level names to join on. These must be found in both
        DataFrames. If `on` is None and not merging on indexes then this defaults
        to the intersection of the columns in both DataFrames.
    left_on : label or list, or array-like
        Column or index level names to join on in the left DataFrame. Can also
        be an array or list of arrays of the length of the left DataFrame.
        These arrays are treated as if they are columns.
    right_on : label or list, or array-like
        Column or index level names to join on in the right DataFrame. Can also
        be an array or list of arrays of the length of the right DataFrame.
        These arrays are treated as if they are columns.
    left_index : bool, default False
        Use the index from the left DataFrame as the join key(s). If it is a
        MultiIndex, the number of keys in the other DataFrame (either the index
        or a number of columns) must match the number of levels.
    right_index : bool, default False
        Use the index from the right DataFrame as the join key. Same caveats as
        left_index.
    sort : bool, default False
        Sort the join keys lexicographically in the result DataFrame. If False,
        the order of the join keys depends on the join type (how keyword).
    suffixes : tuple of (str, str), default ('_x', '_y')
        Suffix to apply to overlapping column names in the left and right
        side, respectively. To raise an exception on overlapping columns use
        (False, False).
    copy : bool, default True
        If False, avoid copy if possible.
    indicator : bool or str, default False
        If True, adds a column to output DataFrame called "_merge" with
        information on the source of each row.
        If string, column with information on source of each row will be added to
        output DataFrame, and column will be named value of string.
        Information column is Categorical-type and takes on a value of "left_only"
        for observations whose merge key only appears in 'left' DataFrame,
        "right_only" for observations whose merge key only appears in 'right'
        DataFrame, and "both" if the observation's merge key is found in both.

    validate : str, optional
        If specified, checks if merge is of specified type.

        * "one_to_one" or "1:1": check if merge keys are unique in both
          left and right datasets.
        * "one_to_many" or "1:m": check if merge keys are unique in left
          dataset.
        * "many_to_one" or "m:1": check if merge keys are unique in right
          dataset.
        * "many_to_many" or "m:m": allowed, but does not result in checks.

        .. versionadded:: 0.21.0

    Returns
    -------
    DataFrame
        A DataFrame of the two merged objects.

    See Also
    --------
    merge_ordered : Merge with optional filling/interpolation.
    merge_asof : Merge on nearest keys.
    DataFrame.join : Similar method using indices.

    Notes
    -----
    Support for specifying index levels as the `on`, `left_on`, and
    `right_on` parameters was added in version 0.23.0
    Support for merging named Series objects was added in version 0.24.0

    Examples
    --------

    >>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [1, 2, 3, 5]})
    >>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [5, 6, 7, 8]})
    >>> df1
        lkey value
    0   foo      1
    1   bar      2
    2   baz      3
    3   foo      5
    >>> df2
        rkey value
    0   foo      5
    1   bar      6
    2   baz      7
    3   foo      8

    Merge df1 and df2 on the lkey and rkey columns. The value columns have
    the default suffixes, _x and _y, appended.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey')
      lkey  value_x rkey  value_y
    0  foo        1  foo        5
    1  foo        1  foo        8
    2  foo        5  foo        5
    3  foo        5  foo        8
    4  bar        2  bar        6
    5  baz        3  baz        7

    Merge DataFrames df1 and df2 with specified left and right suffixes
    appended to any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey',
    ...           suffixes=('_left', '_right'))
      lkey  value_left rkey  value_right
    0  foo           1  foo            5
    1  foo           1  foo            8
    2  foo           5  foo            5
    3  foo           5  foo            8
    4  bar           2  bar            6
    5  baz           3  baz            7

    Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
    any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
    Traceback (most recent call last):
    ...
    ValueError: columns overlap but no suffix specified:
        Index(['value'], dtype='object')

In [117]:
pd.merge(df2,df3, how = "right") # df3

       Name Fcolor Gender Branch
0   Lavanya  White      f    Cse
1   Praveen  Black      m     IT
2    Anurag    Red      m    ECE
3  Nagaraju    NaN      m    CSe
4     Priya    NaN    NaN   Mech

In [118]:
pd.merge(df2,df3, how = "inner") # common data - use intersection of keys from both frames

       Name Fcolor Gender Branch
0   Lavanya  White      f    Cse
1   Praveen  Black      m     IT
2    Anurag    Red      m    ECE
3  Nagaraju    NaN      m    CSe

In [120]:
pd.merge(df2,df3, how = "outer") # all -use union of keys from both frames

       Name Fcolor Gender Branch
0   Lavanya  White      f    Cse
1   Praveen  Black      m     IT
2    Anurag    Red      m    ECE
3  Nagaraju    NaN      m    CSe
4     Priya    NaN    NaN   Mech

# File Reading

In [121]:
data = pd.read_excel("2020-07-25.xlsx")
data

    Unnamed: 0 Roll Number 2020-07-25
0            0  17B81A04H1          P
1            1  198A5F0019          P
2            2  17KD1A0560          P
3            3  17KH1A0455          P
4            4  1210316262          P
5            5  18P31A0555          P
6            6  18B01A0211          P
7            7    Y18IT048          P
8            8  17B81A05B2          P
9            9  169X1A04E0          P
10          10  14F41A0447          P
11          11  17W51D5505          P
12          12  18021D0501          P
13          13    Y18CS034          P
14          14    Y18IT040          P
15          15  154M1A0554          P
16          16  19025A0433          P
17          17   180030816          P
18          18  18A31A1248          P
19          19    Y18IT020          P
20          20  18AT1A0527          P
21          21  18121A02D0          P
22          22    Y18IT055          P
23          23  17NE1A0578          P
24          24    Y17CS108          P
25          25    Y18IT063          P
26          26    Y18IT043          P
27          27  178B1A0561          P
28          28  19A95F0019          P
29          29   180050012          P
30          30  166N1A0546          P
31          31   170040246          P
32          32  188W1A0460          P
33          33  14B21A04E1          P
34          34  18AT1A0559          P
35          35     N160868          P
36          36  153B1A0538          P
37          37  17751A0408          P
38          38  18G31A0439          P
39          39   180030523          P
40          40    Y18IT029          P
41          41  18A81A05M5          P
42          42  18A51A1206          P
43          43  18B91A0209          P
44          44  1210416462          P
45          45     R151263          P
46          46     Y18CS80          P
47          47  17F21A0348          P
48          48  10G11A0209          P
49          49  19B95A0512          P
50          50    Y18IT025          P
51          51    Y18IT092          P
52          52    Y18CS166          P
53          53     R141465          P
54          54  17JN1A0495          P
55          55   170031480          P
56          56  2020239167          P

In [123]:
data = pd.read_csv("birds.csv")
data

,Unnamed: 0,huml,humw,ulnal,ulnaw,feml,femw,tibl,tibw,tarl,tarw,len_type,Mean_Features,huml_and_humw
0,count,419.000000,419.000000,417.000000,418.000000,418.000000,419.000000,418.000000,419.000000,419.000000,419.000000,420.000000,420.000000,419.000000
1,mean,64.650501,4.370573,69.115372,3.597249,36.872416,3.220883,64.662823,3.182339,39.229976,2.930024,1.580952,29.147160,69.021074
2,std,53.834549,2.854617,58.784775,2.186747,19.979082,2.023581,37.838145,2.080827,23.184313,2.185673,0.493992,18.996025,56.462551
3,min,9.850000,1.140000,14.090000,1.000000,11.830000,0.930000,5.500000,0.870000,7.770000,0.660000,1.000000,7.782000,12.730000
4,25%,25.170000,2.190000,28.050000,1.870000,21.297500,1.715000,36.417500,1.565000,23.035000,1.425000,1.000000,14.528500,27.200000
5,50%,44.180000,3.500000,43.710000,2.945000,31.130000,2.520000,52.120000,2.490000,31.740000,2.230000,2.000000,22.382500,48.060000
6,75%,90.310000,5.810000,97.520000,4.770000,47.120000,4.135000,82.870000,4.255000,50.250000,3.500000,2.000000,39.082250,96.190000
7,max,420.000000,17.840000,422.000000,12.000000,117.070000,11.640000,240.000000,11.030000,175.000000,14.090000,2.000000,137.740000,437.840000

In [124]:
data = pd.read_csv("https://raw.githubusercontent.com/AP-Skill-Development-Corporation/Machine-Learning-Online-Training-Public-20-07-2021-to-07-08-2021-/main/Day3_Pandas/PublicBatch.csv")
data

,S.No,College Name,Program Name,Student Name,Registrationid,Phone,Email,Payment Status,Registered Date
0,1,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Mandapaka Anusha,18A91A0534,6.300452e+09,anushamandapaka77@gmail.com,success,6/19/2021
1,2,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Meneti Mounika,18A91A05F0,9.704807e+09,mounikameneti9912@gmail.com,success,6/19/2021
2,3,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Sheik Abdul Hakim,19A95A0504,9.676215e+09,hakeemabd007@gmail.com,success,6/19/2021
3,4,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Sambattula Navya Prasanna,18A91A0552,8.328650e+09,navyasambattula@gmail.com,success,6/19/2021
4,5,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Vijaya Durga Velagala,18A91A05H8,9.502362e+09,vijayadurga.velagala123@gmail.com,success,6/19/2021
5,6,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Budha Bala Atyutha Sri Sai,18A91A0510,8.500388e+09,balasai599@gmail.com,success,6/19/2021
6,7,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Karri Sirish Kumar,18A91A0529,9.491691e+09,karrisirish2000@gmail.com,success,6/19/2021
7,8,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Ramavarapu Mary Ratnam,18A91A0547,7.981134e+09,rpchinnu123@gmail.com,success,6/19/2021
8,9,Aditya Engineering College,Machine Learning Using Python Online 2021-22,M.L.S.Namratha,18A91A05E7,7.013641e+09,namrathamalladi@gmail.com,success,6/21/2021
9,10,BVC Institute of Technology and Science,Machine Learning Using Python Online 2021-22,Naga Swathi Menda,18H41F0006,9.533339e+09,nagaswathimenda97@gmail.com,success,6/25/2021
10,11,BVC Institute of Technology and Science,Machine Learning Using Python Online 2021-22,Bonthu Naga Durga Sravani,18H41F0001,9.121442e+09,sravanibonthu31@gmail.com,success,6/26/2021
11,12,BVC Institute of Technology and Science,Machine Learning Using Python Online 2021-22,Namana Vijaya Lakshmi Naga Durga Devi,18H41F0008,9.550399e+09,Vijayalakshminamana12@gmail.com,success,6/26/2021
12,13,BVC Institute of Technology and Science,Machine Learning Using Python Online 2021-22,Peddireddi Yamini Srilakshmi,18H41F0010,9.153341e+09,yaminisrilakshmipeddireddy@gmail.com,success,6/26/2021
13,14,Eluru College of Engineering and Technology,Machine Learning Using Python Online 2021-22,Sravani Pulavarthi,17JD1A0493,9.346540e+09,pulavarthisravani0209@gmail.com,success,6/25/2021
14,15,G Pulla Reddy Engineering College (Autonomous),Machine Learning Using Python Online 2021-22,Kamini Sowjanya,189X5A02C9,8.247044e+09,sowjanyakamini98@gmail.com,success,6/12/2021
15,16,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Kallepalli Krishna Praneeth Sastry,18131A0374,8.500176e+09,sastrykallepalli@gmail.com,success,6/19/2021
16,17,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Bh Tarun Surya Varma,18131A04M3,7.732080e+09,tarun779911@gmail.com,success,6/23/2021
17,18,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Jahnavi Kalla,18131A0490,8.019774e+09,jahnavikalla@gmail.com,success,6/24/2021
18,19,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Pravallika Kota,18131A04A9,9.160434e+09,pravallikakota2510@gmail.com,success,6/24/2021
19,20,ISTS Women's Engineering College,Machine Learning Using Python Online 2021-22,Pedapudi Pravallika,176W1A0458,9.290074e+09,vallipedapudi458@gmail.com,success,6/22/2021
20,21,K L University,Machine Learning Using Python Online 2021-22,Grandhi Vamsi,170040262,9.182375e+09,9951672988a@gmail.com,success,6/11/2021
21,22,NBKR Institute of Sceince & Technology,Machine Learning Using Python Online 2021-22,N.Sri Giri,18KB1A0373,8.008734e+09,srigirineelam@gmail.com,success,6/24/2021
22,23,Sagi Ramakrishnam Raju Engineering College,Machine Learning Using Python Online 2021-22,Viwanth Manikanta Kankatala,18B91A0594,9.381230e+09,viswanthkankatala111@gmail.com,success,6/19/2021
23,24,Sree Vahini Institute of Science and Technology,Machine Learning Using Python Online 2021-22,Peddedula Saikumar,18MG1A0592,7.995139e+09,saikumar.7138@gmail.com,success,6/22/2021
24,25,Sree Vahini Institute of Science and Technology,Machine Learning Using Python Online 2021-22,Kaviti Siva Krishna,18MG1A0584,9.603959e+09,sivakrishnakaviti920@gmail.com,success,6/22/2021
25,26,Srinivasa Institute of Engineering & Technology,Machine Learning Using Python Online 2021-22,K Jayagowri Sruthi,176N1A0528,8.143153e+09,sruthikodi08@gmail.com,success,6/25/2021
26,27,SRM University,Machine Learning Using Python Online 2021-22,Geetika Karumudi,AP19110010123,7.995043e+09,geetikakarumudi@gmail.com,success,6/7/2021
27,28,Vignan s Institute of Engineering for Women,Machine Learning Using Python Online 2021-22,Divya Naramsetty,18NM1A0311,9.346382e+09,divyanaramsetty@gmail.com,success,6/21/2021
28,29,Vignan s LARA Institute of Technology and Science,Machine Learning Using Python Online 2021-22,Syed.Sameer,18FE1A05E1,9.640334e+09,syedsamee645@gmail.com,success,6/20/2021
29,30,MVGR College of Engineering,Machine Learning Using Python Online 2021-22,Vasireddy Teja,19335A0415,7.095737e+09,teja16052001@gmail.com,success,6/27/2021
30,31,MVGR College of Engineering,Machine Learning Using Python Online 2021-22,Thida Priyanka,18331A04F5,NaN,teedapriyanka@gmail.com,NaN,NaN
31,32,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Metta Likhitha,19131A04F2,7.569078e+09,likhithametta888@gmail.com,NaN,NaN
32,33,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Pallapothula Venkata Sreechandana,19131A04H4,8.688858e+09,19131a04h4@gvpce.ac.in,NaN,NaN
33,34,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Marada Gowrav Srikalyan,19131A04E4,7.396917e+09,gowravsrikalyan1220@gmail.com,NaN,NaN

In [126]:
data.head(3)

,S.No,College Name,Program Name,Student Name,Registrationid,Phone,Email,Payment Status,Registered Date
0,1,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Mandapaka Anusha,18A91A0534,6.300452e+09,anushamandapaka77@gmail.com,success,6/19/2021
1,2,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Meneti Mounika,18A91A05F0,9.704807e+09,mounikameneti9912@gmail.com,success,6/19/2021
2,3,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Sheik Abdul Hakim,19A95A0504,9.676215e+09,hakeemabd007@gmail.com,success,6/19/2021

In [127]:
data.tail()

,S.No,College Name,Program Name,Student Name,Registrationid,Phone,Email,Payment Status,Registered Date
29,30,MVGR College of Engineering,Machine Learning Using Python Online 2021-22,Vasireddy Teja,19335A0415,7.095737e+09,teja16052001@gmail.com,success,6/27/2021
30,31,MVGR College of Engineering,Machine Learning Using Python Online 2021-22,Thida Priyanka,18331A04F5,NaN,teedapriyanka@gmail.com,NaN,NaN
31,32,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Metta Likhitha,19131A04F2,7.569078e+09,likhithametta888@gmail.com,NaN,NaN
32,33,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Pallapothula Venkata Sreechandana,19131A04H4,8.688858e+09,19131a04h4@gvpce.ac.in,NaN,NaN
33,34,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Marada Gowrav Srikalyan,19131A04E4,7.396917e+09,gowravsrikalyan1220@gmail.com,NaN,NaN

In [133]:
data.sample(3) # random selection

,S.No,College Name,Program Name,Student Name,Registrationid,Phone,Email,Payment Status,Registered Date
0,1,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Mandapaka Anusha,18A91A0534,6.300452e+09,anushamandapaka77@gmail.com,success,6/19/2021
31,32,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Metta Likhitha,19131A04F2,7.569078e+09,likhithametta888@gmail.com,NaN,NaN
27,28,Vignan s Institute of Engineering for Women,Machine Learning Using Python Online 2021-22,Divya Naramsetty,18NM1A0311,9.346382e+09,divyanaramsetty@gmail.com,success,6/21/2021

In [135]:
type(data)

pandas.core.frame.DataFrame

# Exporting Data

In [136]:
data[:100].to_csv("student.csv")

In [137]:
data.to_excel("Details.xlsx")

In [139]:
data.to_dict()

{'S.No': {0: 1,
  1: 2,
  2: 3,
  3: 4,
  4: 5,
  5: 6,
  6: 7,
  7: 8,
  8: 9,
  9: 10,
  10: 11,
  11: 12,
  12: 13,
  13: 14,
  14: 15,
  15: 16,
  16: 17,
  17: 18,
  18: 19,
  19: 20,
  20: 21,
  21: 22,
  22: 23,
  23: 24,
  24: 25,
  25: 26,
  26: 27,
  27: 28,
  28: 29,
  29: 30,
  30: 31,
  31: 32,
  32: 33,
  33: 34},
 'College Name': {0: 'Aditya Engineering College',
  1: 'Aditya Engineering College',
  2: 'Aditya Engineering College',
  3: 'Aditya Engineering College',
  4: 'Aditya Engineering College',
  5: 'Aditya Engineering College',
  6: 'Aditya Engineering College',
  7: 'Aditya Engineering College',
  8: 'Aditya Engineering College',
  9: 'BVC Institute of Technology and Science',
  10: 'BVC Institute of Technology and Science',
  11: 'BVC Institute of Technology and Science',
  12: 'BVC Institute of Technology and Science',
  13: 'Eluru College of Engineering and Technology',
  14: 'G Pulla Reddy Engineering College (Autonomous)',
  15: 'Gayatri Vidya Parishad College of Engineering',
  16: 'Gayatri Vidya Parishad College of Engineering',
  17: 'Gayatri Vidya Parishad College of Engineering',
  18: 'Gayatri Vidya Parishad College of Engineering',
  19: "ISTS Women's Engineering College",
  20: 'K L University',
  21: 'NBKR Institute of Sceince & Technology',
  22: 'Sagi Ramakrishnam Raju Engineering College',
  23: 'Sree Vahini Institute of Science and Technology',
  24: 'Sree Vahini Institute of Science and Technology',
  25: 'Srinivasa Institute of Engineering & Technology',
  26: 'SRM University',
  27: 'Vignan s Institute of Engineering for Women',
  28: 'Vignan s LARA Institute of Technology and Science',
  29: 'MVGR College of Engineering',
  30: 'MVGR College of Engineering',
  31: 'Gayatri Vidya Parishad College of Engineering',
  32: 'Gayatri Vidya Parishad College of Engineering',
  33: 'Gayatri Vidya Parishad College of Engineering'},
 'Program Name': {0: 'Machine Learning Using Python Online 2021-22',
  1: 'Machine Learning Using Python Online 2021-22',
  2: 'Machine Learning Using Python Online 2021-22',
  3: 'Machine Learning Using Python Online 2021-22',
  4: 'Machine Learning Using Python Online 2021-22',
  5: 'Machine Learning Using Python Online 2021-22',
  6: 'Machine Learning Using Python Online 2021-22',
  7: 'Machine Learning Using Python Online 2021-22',
  8: 'Machine Learning Using Python Online 2021-22',
  9: 'Machine Learning Using Python Online 2021-22',
  10: 'Machine Learning Using Python Online 2021-22',
  11: 'Machine Learning Using Python Online 2021-22',
  12: 'Machine Learning Using Python Online 2021-22',
  13: 'Machine Learning Using Python Online 2021-22',
  14: 'Machine Learning Using Python Online 2021-22',
  15: 'Machine Learning Using Python Online 2021-22',
  16: 'Machine Learning Using Python Online 2021-22',
  17: 'Machine Learning Using Python Online 2021-22',
  18: 'Machine Learning Using Python Online 2021-22',
  19: 'Machine Learning Using Python Online 2021-22',
  20: 'Machine Learning Using Python Online 2021-22',
  21: 'Machine Learning Using Python Online 2021-22',
  22: 'Machine Learning Using Python Online 2021-22',
  23: 'Machine Learning Using Python Online 2021-22',
  24: 'Machine Learning Using Python Online 2021-22',
  25: 'Machine Learning Using Python Online 2021-22',
  26: 'Machine Learning Using Python Online 2021-22',
  27: 'Machine Learning Using Python Online 2021-22',
  28: 'Machine Learning Using Python Online 2021-22',
  29: 'Machine Learning Using Python Online 2021-22',
  30: 'Machine Learning Using Python Online 2021-22',
  31: 'Machine Learning Using Python Online 2021-22',
  32: 'Machine Learning Using Python Online 2021-22',
  33: 'Machine Learning Using Python Online 2021-22'},
 'Student Name': {0: 'Mandapaka Anusha',
  1: 'Meneti Mounika',
  2: 'Sheik Abdul Hakim',
  3: 'Sambattula Navya Prasanna',
  4: 'Vijaya Durga Velagala',
  5: 'Budha Bala Atyutha Sri Sai',
  6: 'Karri Sirish Kumar',
  7: 'Ramavarapu Mary Ratnam',
  8: 'M.L.S.Namratha',
  9: 'Naga Swathi Menda',
  10: 'Bonthu Naga Durga Sravani',
  11: 'Namana Vijaya Lakshmi Naga Durga Devi',
  12: 'Peddireddi Yamini Srilakshmi',
  13: 'Sravani Pulavarthi',
  14: 'Kamini Sowjanya',
  15: 'Kallepalli Krishna Praneeth Sastry',
  16: 'Bh Tarun Surya Varma',
  17: 'Jahnavi Kalla',
  18: 'Pravallika Kota',
  19: 'Pedapudi Pravallika',
  20: 'Grandhi Vamsi',
  21: 'N.Sri Giri',
  22: 'Viwanth Manikanta Kankatala',
  23: 'Peddedula Saikumar',
  24: 'Kaviti Siva Krishna',
  25: 'K Jayagowri Sruthi',
  26: 'Geetika Karumudi',
  27: 'Divya Naramsetty',
  28: 'Syed.Sameer',
  29: 'Vasireddy Teja',
  30: 'Thida Priyanka',
  31: 'Metta Likhitha',
  32: 'Pallapothula Venkata Sreechandana',
  33: 'Marada Gowrav Srikalyan'},
 'Registrationid': {0: '18A91A0534',
  1: '18A91A05F0',
  2: '19A95A0504',
  3: '18A91A0552',
  4: '18A91A05H8',
  5: '18A91A0510',
  6: '18A91A0529',
  7: '18A91A0547',
  8: '18A91A05E7',
  9: '18H41F0006',
  10: '18H41F0001',
  11: '18H41F0008',
  12: '18H41F0010',
  13: '17JD1A0493',
  14: '189X5A02C9',
  15: '18131A0374',
  16: '18131A04M3',
  17: '18131A0490',
  18: '18131A04A9',
  19: '176W1A0458',
  20: '170040262',
  21: '18KB1A0373',
  22: '18B91A0594',
  23: '18MG1A0592',
  24: '18MG1A0584',
  25: '176N1A0528',
  26: 'AP19110010123',
  27: '18NM1A0311',
  28: '18FE1A05E1',
  29: '19335A0415',
  30: '18331A04F5',
  31: '19131A04F2',
  32: '19131A04H4',
  33: '19131A04E4'},
 'Phone': {0: 6300451737.0,
  1: 9704807386.0,
  2: 9676215460.0,
  3: 8328650363.0,
  4: 9502361649.0,
  5: 8500387777.0,
  6: 9491690743.0,
  7: 7981133701.0,
  8: 7013640620.0,
  9: 9533338859.0,
  10: 9121442336.0,
  11: 9550398528.0,
  12: 9153341234.0,
  13: 9346539753.0,
  14: 8247044264.0,
  15: 8500175543.0,
  16: 7732079997.0,
  17: 8019774354.0,
  18: 9160433893.0,
  19: 9290074491.0,
  20: 9182374518.0,
  21: 8008733538.0,
  22: 9381230113.0,
  23: 7995139105.0,
  24: 9603959089.0,
  25: 8143152678.0,
  26: 7995043490.0,
  27: 9346382189.0,
  28: 9640333667.0,
  29: 7095737437.0,
  30: nan,
  31: 7569077570.0,
  32: 8688858296.0,
  33: 7396916992.0},
 'Email': {0: 'anushamandapaka77@gmail.com',
  1: 'mounikameneti9912@gmail.com',
  2: 'hakeemabd007@gmail.com',
  3: 'navyasambattula@gmail.com',
  4: 'vijayadurga.velagala123@gmail.com',
  5: 'balasai599@gmail.com',
  6: 'karrisirish2000@gmail.com',
  7: 'rpchinnu123@gmail.com',
  8: 'namrathamalladi@gmail.com',
  9: 'nagaswathimenda97@gmail.com',
  10: 'sravanibonthu31@gmail.com',
  11: 'Vijayalakshminamana12@gmail.com',
  12: 'yaminisrilakshmipeddireddy@gmail.com',
  13: 'pulavarthisravani0209@gmail.com',
  14: 'sowjanyakamini98@gmail.com',
  15: 'sastrykallepalli@gmail.com',
  16: 'tarun779911@gmail.com',
  17: 'jahnavikalla@gmail.com',
  18: 'pravallikakota2510@gmail.com',
  19: 'vallipedapudi458@gmail.com',
  20: '9951672988a@gmail.com',
  21: 'srigirineelam@gmail.com',
  22: 'viswanthkankatala111@gmail.com',
  23: 'saikumar.7138@gmail.com',
  24: 'sivakrishnakaviti920@gmail.com',
  25: 'sruthikodi08@gmail.com',
  26: 'geetikakarumudi@gmail.com',
  27: 'divyanaramsetty@gmail.com',
  28: 'syedsamee645@gmail.com',
  29: 'teja16052001@gmail.com',
  30: 'teedapriyanka@gmail.com',
  31: 'likhithametta888@gmail.com',
  32: '19131a04h4@gvpce.ac.in',
  33: 'gowravsrikalyan1220@gmail.com'},
 'Payment Status': {0: 'success',
  1: 'success',
  2: 'success',
  3: 'success',
  4: 'success',
  5: 'success',
  6: 'success',
  7: 'success',
  8: 'success',
  9: 'success',
  10: 'success',
  11: 'success',
  12: 'success',
  13: 'success',
  14: 'success',
  15: 'success',
  16: 'success',
  17: 'success',
  18: 'success',
  19: 'success',
  20: 'success',
  21: 'success',
  22: 'success',
  23: 'success',
  24: 'success',
  25: 'success',
  26: 'success',
  27: 'success',
  28: 'success',
  29: 'success',
  30: nan,
  31: nan,
  32: nan,
  33: nan},
 'Registered Date': {0: '6/19/2021',
  1: '6/19/2021',
  2: '6/19/2021',
  3: '6/19/2021',
  4: '6/19/2021',
  5: '6/19/2021',
  6: '6/19/2021',
  7: '6/19/2021',
  8: '6/21/2021',
  9: '6/25/2021',
  10: '6/26/2021',
  11: '6/26/2021',
  12: '6/26/2021',
  13: '6/25/2021',
  14: '6/12/2021',
  15: '6/19/2021',
  16: '6/23/2021',
  17: '6/24/2021',
  18: '6/24/2021',
  19: '6/22/2021',
  20: '6/11/2021',
  21: '6/24/2021',
  22: '6/19/2021',
  23: '6/22/2021',
  24: '6/22/2021',
  25: '6/25/2021',
  26: '6/7/2021',
  27: '6/21/2021',
  28: '6/20/2021',
  29: '6/27/2021',
  30: nan,
  31: nan,
  32: nan,
  33: nan}}

In [140]:
data.columns

Index(['S.No', 'College Name', 'Program Name', 'Student Name',
       'Registrationid', 'Phone', 'Email', 'Payment Status',
       'Registered Date'],
      dtype='object')

In [141]:
data.index

RangeIndex(start=0, stop=34, step=1)

In [142]:
data.describe()

            S.No         Phone
count  34.000000  3.300000e+01
mean   17.500000  8.612149e+09
std     9.958246  9.159482e+08
min     1.000000  6.300452e+09
25%     9.250000  7.995139e+09
50%    17.500000  8.688858e+09
75%    25.750000  9.381230e+09
max    34.000000  9.704807e+09

In [146]:
data["S.No"].sum()

595

In [147]:
data.count()

S.No               34
College Name       34
Program Name       34
Student Name       34
Registrationid     34
Phone              33
Email              34
Payment Status     30
Registered Date    30
dtype: int64

In [149]:
data.max()

S.No                                                             34
College Name      Vignan s LARA Institute of Technology and Science
Program Name           Machine Learning Using Python Online 2021-22
Student Name                            Viwanth Manikanta Kankatala
Registrationid                                        AP19110010123
Phone                                                   9.70481e+09
Email                          yaminisrilakshmipeddireddy@gmail.com
dtype: object

In [150]:
data.min()

S.No                                                         1
College Name                        Aditya Engineering College
Program Name      Machine Learning Using Python Online 2021-22
Student Name                              Bh Tarun Surya Varma
Registrationid                                       170040262
Phone                                              6.30045e+09
Email                                   19131a04h4@gvpce.ac.in
dtype: object

In [154]:
data["S.No"].idxmax()

33